Tests/LoadTest/UseCaseA.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com/"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 100
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "All recipes"
    flow:
      - get:
          url: "/recipes"
      - think: 2