Tests/LoadTest/UseCaseB.yml
config:
  plugins:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Choose one recipe"
    flow:
      - get:
          url: "/recipes"
      - think: 2
      - get:
          url: "/recipes/2"
      - think: 1